app/Controllers/AdminController.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@inventory.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session = \Config\Services::session();
        $adminModel = new AdminModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('admin_password');
        $admin = $adminModel->where('email', $email)->first();

SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `inventory_items`
SELECT COUNT(*) AS `numrows`
FROM `allocations`
WHERE `status` = 'Active'
SELECT `allocations`.`allocation_date`, `allocations`.`return_date`, `allocations`.`status`, `students`.`name` as `student_name`, `students`.`roll_no`, `inventory_items`.`item_name`
FROM `allocations`
JOIN `students` ON `students`.`id` = `allocations`.`student_id`
JOIN `inventory_items` ON `inventory_items`.`id` = `allocations`.`item_id`
ORDER BY `allocations`.`allocation_date` DESC
---
    public function dashboard()
    {
        $session = \Config\Services::session();
        if (!$session->get('isAdminLoggedIn')) {
            $session->setFlashdata('error', 'First Admin Done Login !');
            return redirect()->to('admin/login');
        }
        $db = \Config\Database::connect();
        $data['total_students'] = $db->table('students')->countAllResults();
        $data['total_items'] = $db->table('inventory_items')->countAllResults();
        $data['active_issues'] = $db->table('allocations')->where('status', 'Active')->countAllResults();
        $builder = $db->table('allocations');
        $builder->select('allocations.allocation_date, allocations.return_date, allocations.status, students.name as student_name, students.roll_no, inventory_items.item_name');
        $builder->join('students', 'students.id = allocations.student_id');
        $builder->join('inventory_items', 'inventory_items.id = allocations.item_id');
        $builder->orderBy('allocations.allocation_date', 'DESC');
        $query = $builder->get();