app/Controllers/DashboardController.php

SELECT `allocations`.`id` as `alloc_id`, `allocations`.`allocation_date`, `allocations`.`status`, `inventory_items`.`item_name`, `inventory_items`.`id` as `item_id`
FROM `allocations`
JOIN `inventory_items` ON `inventory_items`.`id` = `allocations`.`item_id`
WHERE `allocations`.`student_id` = '1'
AND `allocations`.`status` = 'Active'
---
    public function index()
    {
        $session = \Config\Services::session();
        if (!$session->get('isLoggedIn')) {
            $session->setFlashdata('error', 'First Login Then you can view dashboard.');
            return redirect()->to('login');
        }
        $student_id = $session->get('student_id');
        $db = \Config\Database::connect();
        $builder = $db->table('allocations');
        $builder->select('allocations.id as alloc_id, allocations.allocation_date, allocations.status, inventory_items.item_name, inventory_items.id as item_id');
        $builder->join('inventory_items', 'inventory_items.id = allocations.item_id');
        $builder->where('allocations.student_id', $student_id);
        $builder->where('allocations.status', 'Active');
        $query = $builder->get();

SELECT *
FROM `inventory_items`
---
    public function viewItems()
    {
        $session = \Config\Services::session();
        if (!$session->get('isLoggedIn') && !$session->get('isAdminLoggedIn')) {
            return redirect()->to('login');
        }

        $itemModel = new \App\Models\InventoryItemModel();
        $search = $this->request->getGet('search');
        if (!empty($search)) {
            $data['stationery_items'] = $itemModel->groupStart()
                                                  ->like('item_name', $search)
                                                  ->orLike('category', $search)
                                                  ->groupEnd()
                                                  ->findAll();
        } else {
            $data['stationery_items'] = $itemModel->findAll();

UPDATE `inventory_items` SET `available_quantity` = 14
WHERE `inventory_items`.`id` IN ('2')
---
    public function borrowItem($item_id)
    {
        $session = \Config\Services::session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('login');
        }
        $itemModel = new \App\Models\InventoryItemModel();
        $allocationModel = new \App\Models\AllocationModel();
        $student_id = $session->get('student_id');
        $item = $itemModel->find($item_id);
        if ($item['available_quantity'] > 0) {
            $allocData = [
                'student_id'         => $student_id,
                'item_id'            => $item_id,
                'quantity_allocated' => 1,
                'allocation_date'    => date('Y-m-d'),
                'status'             => 'Active'
            ];
            $allocationModel->insert($allocData);
            $newQuantity = $item['available_quantity'] - 1;
            $itemModel->update($item_id, ['available_quantity' => $newQuantity]);

SELECT *
FROM `inventory_items`
WHERE `inventory_items`.`id` = '2'
---
    public function returnItem($alloc_id, $item_id)
    {
        $session = \Config\Services::session();
        $itemModel = new \App\Models\InventoryItemModel();
        $allocationModel = new \App\Models\AllocationModel();
        $allocationModel->update($alloc_id, ['status' => 'Returned', 'return_date' => date('Y-m-d')]);
        $item = $itemModel->find($item_id);