app/Controllers/StudentController.php

SELECT *
FROM `students`
WHERE `email` = 'mahi@gmail.com'
 LIMIT 1
---
    public function store()
    {
        $studentModel = new StudentModel();
        $raw_password = $this->request->getPost("student_password");
        $hashed_password = password_hash($raw_password, PASSWORD_DEFAULT);
        $session = \config\Services::session();
        $email = $this->request->getPost("email");
        $existingStudent = $studentModel->where("email", $email)->first();

SELECT *
FROM `students`
WHERE `email` = 'mahi@gmail.com'
 LIMIT 1
---
    public function authenticate(){
        $session = \Config\Services::session();
        $studentModel = new StudentModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('student_password');
        $data = $studentModel->where('email', $email)->first();

SELECT `allocations`.`allocation_date`, `allocations`.`return_date`, `allocations`.`status`, `inventory_items`.`item_name`
FROM `allocations`
JOIN `inventory_items` ON `inventory_items`.`id` = `allocations`.`item_id`
WHERE `allocations`.`student_id` = '1'
ORDER BY `allocations`.`allocation_date` DESC
---
    public function myHistory()
    {
        $session = \Config\Services::session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('login');
        }
        $student_id = $session->get('student_id');
        $db = \Config\Database::connect();
        $builder = $db->table('allocations');
        $builder->select('allocations.allocation_date, allocations.return_date, allocations.status, inventory_items.item_name');
        $builder->join('inventory_items', 'inventory_items.id = allocations.item_id');
        $builder->where('allocations.student_id', $student_id);
        $builder->orderBy('allocations.allocation_date', 'DESC');
        $query = $builder->get();